BOT_TOKEN = "8311147492:AAFK2E8wlwOGYr4mJViyqbcMccJwsX_yJAQ"

schedule_yana = {
    'пн': {
        'первая': [
            {'subject': 'Внешнеэкономическая деятельность и таможенные системы', 'time': '13:55-15:30', 'room': 'Ауд. 1108 К.8', 'teacher': ' Седюкевич В.Н.', 'type': 'Лекция'},
            {'subject': 'Внешнеэкономическая деятельность и таможенные системы', 'time': '15:40-17:15', 'room': 'Ауд. 1108 К.8', 'teacher': ' Седюкевич В.Н.', 'type': 'Лекция'},
            {'subject': 'Внешнеэкономическая деятельность и таможенные системы', 'time': '17:45-19:20', 'room': 'Ауд. 1108 К.8', 'teacher': ' Седюкевич В.Н.', 'type': 'Лабораторное занятие'},
        ],
        'вторая': [
             {'subject': 'Внешнеэкономическая деятельность и таможенные системы', 'time': '13:55-15:30', 'room': 'Ауд. 1108 К.8', 'teacher': ' Седюкевич В.Н.', 'type': 'Лекция'},
            {'subject': 'Внешнеэкономическая деятельность и таможенные системы', 'time': '15:40-17:15', 'room': 'Ауд. 1108 К.8', 'teacher': ' Седюкевич В.Н.', 'type': 'Лекция'},
        ]
    },
    'вт': {
        'первая': [
            {'subject': 'Основы эколого-энергетической устойчивости производства', 'time': '15:40-17:15', 'room': 'Ауд. 3п К.17', 'teacher': 'Рекс А.Г.', 'type': 'Лекция'},
            {'subject': 'Основы эколого-энергетической устойчивости производства', 'time': '17:45-19:20', 'room': 'Ауд. 428 К.18', 'teacher': 'Мартынюк С.С.', 'type': 'Лабораторное занятие'},
        ],
        'вторая': [
            {'subject': 'Охрана труда', 'time': '13:55-15:30', 'room': 'Ауд. 381 К.1', 'teacher': 'Абметко О.В.', 'type': 'Лабораторное занятие'},
            {'subject': 'Основы эколого-энергетической устойчивости производства', 'time': '15:40-17:15', 'room': 'Ауд. 3п К.17', 'teacher': 'Мартынюк С.С.', 'type': 'Лекция'},
        ]
    },
    'ср': {
        'первая': [
            {'subject': 'Международные перевозки опасных грузов', 'time': '13:55-15:30', 'room': 'Ауд. 1103 К.8', 'teacher': 'Ходоскин Д.П.', 'type': 'Лекция'},
            {'subject': 'Международные перевозки опасных грузов', 'time': '15:40-17:15', 'room': 'Ауд. 1103 К.8', 'teacher': 'Ходоскин Д.П.', 'type': 'Лекция'},
            {'subject': 'Международные автоперевозки грузов и ТЭД ', 'time': '17:45-19:20', 'room': 'Ауд. 802 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Курсовое проектирование'},
        ],
        'вторая': [
           {'subject': 'Международные перевозки опасных грузов', 'time': '13:55-15:30', 'room': 'Ауд. 1103 К.8', 'teacher': 'Ходоскин Д.П.', 'type': 'Лекция'},
            {'subject': 'Международные перевозки опасных грузов', 'time': '15:40-17:15', 'room': 'Ауд. 1103 К.8', 'teacher': 'Ходоскин Д.П.', 'type': 'Практика'},
            {'subject': 'Испанский язык', 'time': '19.30-21.05', 'room': 'Ауд. К.18', 'teacher': 'Дашка Ивановна', 'type': 'Практика'},
        ]
    },
    'чт': {
        'первая': [
            {'subject': 'Международные автоперевозки грузов и ТЭД', 'time': '13:55-15:30', 'room': 'Ауд. 1106 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Лабораторное занятие'},
            {'subject': 'Международные автоперевозки грузов и ТЭД', 'time': '15:40-17:15', 'room': 'Ауд. 1106 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Лекция'},
            {'subject': 'Охрана труда', 'time': '17:45-19:20', 'room': 'Ауд. 453 К.1', 'teacher': 'Абметко О.В.', 'type': 'Лекция'},
            {'subject': 'Испанский язык', 'time': '19.30-21.05', 'room': 'Ауд. К.18', 'teacher': 'Дашка Ивановна', 'type': 'Практика'},
            
            

        ],
        'вторая': [
            {'subject': 'Международные автоперевозки грузов и ТЭД', 'time': '15:40-17:15', 'room': 'Ауд. 1106 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Лекция'},
            {'subject': 'Охрана труда', 'time': '17:45-19:20', 'room': 'Ауд. 453 К.1', 'teacher': 'Абметко О.В.', 'type': 'Лекция'},
            {'subject': 'Испанский язык', 'time': '19.30-21.05', 'room': 'Ауд. К.18', 'teacher': 'Дашка Ивановна', 'type': 'Практика'},
            ]
    },
    'пт': {
        'первая': [
            {'subject': 'Международные автоперевозки грузов и ТЭД', 'time': '13:55-15:30', 'room': 'Ауд. 1103 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Лекция'},
            {'subject': 'Бухгалтеский учет. Биржевое и банковское дело', 'time': '15:40-17:15', 'room': 'Ауд. 608 К.8', 'teacher': 'Мойсак О.И.', 'type': 'Лекция'},
            {'subject': 'Бухгалтеский учет. Биржевое и банковское дело', 'time': '17:45-19:20', 'room': 'Ауд. 321 К.8', 'teacher': 'Мойсак О.И.', 'type': 'Практика'},

        ],
        'вторая': [
            {'subject': 'Международные автоперевозки грузов и ТЭД', 'time': '13:55-15:30', 'room': 'Ауд. 1103 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Лекция'},
            {'subject': 'Бухгалтеский учет. Биржевое и банковское дело', 'time': '15:40-17:15', 'room': 'Ауд. 608 К.8', 'teacher': 'Мойсак О.И.', 'type': 'Лекция'},
            {'subject': 'Международные автоперевозки грузов и ТЭД', 'time': '17:45-19:20', 'room': 'Ауд. 1103 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Практика'},
        ]
    },
    'сб': {
        'первая': [
            {'subject': 'Транспортные тарифы', 'time': '9:55-11:30', 'room': 'Ауд. 804 К.8', 'teacher': 'Семченков С.С.', 'type': 'Лекция'},
            {'subject': 'Транспортные тарифы', 'time': '12:00-13:35', 'room': 'Ауд. 804 К.8', 'teacher': 'Семченков С.С.', 'type': 'Практика'},

        ],
        'вторая': [
            {'subject': 'Транспортные тарифы', 'time': '9:55-11:30', 'room': 'Ауд. 804 К.8', 'teacher': 'Семченков С.С.', 'type': 'Лекция'},
]
    },
}
schedule_ksenia = {
    'пн': {
        'первая': [
            {'subject': 'Внешнеэкономическая деятельность и таможенные системы', 'time': '13:55-15:30', 'room': 'Ауд. 1108 К.8', 'teacher': ' Седюкевич В.Н.', 'type': 'Лекция'},
            {'subject': 'Внешнеэкономическая деятельность и таможенные системы', 'time': '15:40-17:15', 'room': 'Ауд. 1108 К.8', 'teacher': ' Седюкевич В.Н.', 'type': 'Лекция'},
            {'subject': 'Внешнеэкономическая деятельность и таможенные системы', 'time': '17:45-19:20', 'room': 'Ауд. 1108 К.8', 'teacher': ' Седюкевич В.Н.', 'type': 'Лабораторное занятие'},
        ],
        'вторая': [
             {'subject': 'Внешнеэкономическая деятельность и таможенные системы', 'time': '13:55-15:30', 'room': 'Ауд. 1108 К.8', 'teacher': ' Седюкевич В.Н.', 'type': 'Лекция'},
            {'subject': 'Внешнеэкономическая деятельность и таможенные системы', 'time': '15:40-17:15', 'room': 'Ауд. 1108 К.8', 'teacher': ' Седюкевич В.Н.', 'type': 'Лекция'},
        ]
    },
    'вт': {
        'первая': [
            {'subject': 'Иностранный Язык', 'time': '9:55-11:30', 'room': 'Ауд. ?', 'teacher': '?', 'type': 'Практика'},
            {'subject': 'Основы эколого-энергетической устойчивости производства', 'time': '15:40-17:15', 'room': 'Ауд. 3п К.17', 'teacher': 'Рекс А.Г.', 'type': 'Лекция'},
            {'subject': 'Основы эколого-энергетической устойчивости производства', 'time': '17:45-19:20', 'room': 'Ауд. 428 К.18', 'teacher': 'Мартынюк С.С.', 'type': 'Лабораторное занятие'},
        ],
        'вторая': [
            {'subject': 'Иностранный Язык', 'time': '9:55-11:30', 'room': 'Ауд. ?', 'teacher': '?', 'type': 'Практика'},
            {'subject': 'Охрана труда', 'time': '13:55-15:30', 'room': 'Ауд. 381 К.1', 'teacher': 'Абметко О.В.', 'type': 'Лабораторное занятие'},
            {'subject': 'Основы эколого-энергетической устойчивости производства', 'time': '15:40-17:15', 'room': 'Ауд. 3п К.17', 'teacher': 'Мартынюк С.С.', 'type': 'Лекция'},
        ]
    },
    'ср': {
        'первая': [
            {'subject': 'Международные перевозки опасных грузов', 'time': '13:55-15:30', 'room': 'Ауд. 1103 К.8', 'teacher': 'Ходоскин Д.П.', 'type': 'Лекция'},
            {'subject': 'Международные перевозки опасных грузов', 'time': '15:40-17:15', 'room': 'Ауд. 1103 К.8', 'teacher': 'Ходоскин Д.П.', 'type': 'Лекция'},
            {'subject': 'Международные автоперевозки грузов и ТЭД ', 'time': '17:45-19:20', 'room': 'Ауд. 802 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Курсовое проектирование'},
        ],
        'вторая': [
           {'subject': 'Международные перевозки опасных грузов', 'time': '13:55-15:30', 'room': 'Ауд. 1103 К.8', 'teacher': 'Ходоскин Д.П.', 'type': 'Лекция'},
            {'subject': 'Международные перевозки опасных грузов', 'time': '15:40-17:15', 'room': 'Ауд. 1103 К.8', 'teacher': 'Ходоскин Д.П.', 'type': 'Практика'},
        ]
    },
    'чт': {
        'первая': [
            {'subject': 'Международные автоперевозки грузов и ТЭД', 'time': '13:55-15:30', 'room': 'Ауд. 1106 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Лабораторное занятие'},
            {'subject': 'Международные автоперевозки грузов и ТЭД', 'time': '15:40-17:15', 'room': 'Ауд. 1106 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Лекция'},
            {'subject': 'Охрана труда', 'time': '17:45-19:20', 'room': 'Ауд. 453 К.1', 'teacher': 'Абметко О.В.', 'type': 'Лекция'},
            
            

        ],
        'вторая': [
            {'subject': 'Международные автоперевозки грузов и ТЭД', 'time': '15:40-17:15', 'room': 'Ауд. 1106 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Лекция'},
            {'subject': 'Охрана труда', 'time': '17:45-19:20', 'room': 'Ауд. 453 К.1', 'teacher': 'Абметко О.В.', 'type': 'Лекция'},
            ]
    },
    'пт': {
        'первая': [
            {'subject': 'Международные автоперевозки грузов и ТЭД', 'time': '13:55-15:30', 'room': 'Ауд. 1103 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Лекция'},
            {'subject': 'Бухгалтеский учет. Биржевое и банковское дело', 'time': '15:40-17:15', 'room': 'Ауд. 608 К.8', 'teacher': 'Мойсак О.И.', 'type': 'Лекция'},
            {'subject': 'Бухгалтеский учет. Биржевое и банковское дело', 'time': '17:45-19:20', 'room': 'Ауд. 321 К.8', 'teacher': 'Мойсак О.И.', 'type': 'Практика'},

        ],
        'вторая': [
            {'subject': 'Международные автоперевозки грузов и ТЭД', 'time': '13:55-15:30', 'room': 'Ауд. 1103 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Лекция'},
            {'subject': 'Бухгалтеский учет. Биржевое и банковское дело', 'time': '15:40-17:15', 'room': 'Ауд. 608 К.8', 'teacher': 'Мойсак О.И.', 'type': 'Лекция'},
            {'subject': 'Международные автоперевозки грузов и ТЭД', 'time': '17:45-19:20', 'room': 'Ауд. 1103 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Практика'},
        ]
    },
    'сб': {
        'первая': [
            {'subject': 'Транспортные тарифы', 'time': '9:55-11:30', 'room': 'Ауд. 804 К.8', 'teacher': 'Семченков С.С.', 'type': 'Лекция'},
            {'subject': 'Транспортные тарифы', 'time': '12:00-13:35', 'room': 'Ауд. 804 К.8', 'teacher': 'Семченков С.С.', 'type': 'Практика'},

        ],
        'вторая': [
            {'subject': 'Транспортные тарифы', 'time': '9:55-11:30', 'room': 'Ауд. 804 К.8', 'teacher': 'Семченков С.С.', 'type': 'Лекция'},
]
    },
}
schedule_alina = {
    'пн': {
        'первая': [
            {'subject': 'Английский Язык', 'time': '12:00-13:35', 'room': 'Ауд. 408 К.18', 'teacher': 'Ладутько Н.Ф.', 'type': 'Практика'},
            {'subject': 'Внешнеэкономическая деятельность и таможенные системы', 'time': '13:55-15:30', 'room': 'Ауд. 1108 К.8', 'teacher': ' Седюкевич В.Н.', 'type': 'Лекция'},
            {'subject': 'Внешнеэкономическая деятельность и таможенные системы', 'time': '15:40-17:15', 'room': 'Ауд. 1108 К.8', 'teacher': ' Седюкевич В.Н.', 'type': 'Лекция'},
            {'subject': 'Внешнеэкономическая деятельность и таможенные системы', 'time': '17:45-19:20', 'room': 'Ауд. 1108 К.8', 'teacher': ' Седюкевич В.Н.', 'type': 'Лабораторное занятие'},
        ],
        'вторая': [
            {'subject': 'Английский Язык', 'time': '12:00-13:35', 'room': 'Ауд. 408 К.18', 'teacher': 'Ладутько Н.Ф.', 'type': 'Практика'},
            {'subject': 'Внешнеэкономическая деятельность и таможенные системы', 'time': '13:55-15:30', 'room': 'Ауд. 1108 К.8', 'teacher': ' Седюкевич В.Н.', 'type': 'Лекция'},
            {'subject': 'Внешнеэкономическая деятельность и таможенные системы', 'time': '15:40-17:15', 'room': 'Ауд. 1108 К.8', 'teacher': ' Седюкевич В.Н.', 'type': 'Лекция'},
        ]
    },
    'вт': {
        'первая': [
            {'subject': 'Основы эколого-энергетической устойчивости производства', 'time': '15:40-17:15', 'room': 'Ауд. 3п К.17', 'teacher': 'Рекс А.Г.', 'type': 'Лекция'},
            {'subject': 'Основы эколого-энергетической устойчивости производства', 'time': '17:45-19:20', 'room': 'Ауд. 428 К.18', 'teacher': 'Мартынюк С.С.', 'type': 'Лабораторное занятие'},
        ],
        'вторая': [
            {'subject': 'Охрана труда', 'time': '13:55-15:30', 'room': 'Ауд. 381 К.1', 'teacher': 'Абметко О.В.', 'type': 'Лабораторное занятие'},
            {'subject': 'Основы эколого-энергетической устойчивости производства', 'time': '15:40-17:15', 'room': 'Ауд. 3п К.17', 'teacher': 'Мартынюк С.С.', 'type': 'Лекция'},
        ]
    },
    'ср': {
        'первая': [
            {'subject': 'Международные перевозки опасных грузов', 'time': '13:55-15:30', 'room': 'Ауд. 1103 К.8', 'teacher': 'Ходоскин Д.П.', 'type': 'Лекция'},
            {'subject': 'Международные перевозки опасных грузов', 'time': '15:40-17:15', 'room': 'Ауд. 1103 К.8', 'teacher': 'Ходоскин Д.П.', 'type': 'Лекция'},
            {'subject': 'Международные автоперевозки грузов и ТЭД ', 'time': '17:45-19:20', 'room': 'Ауд. 802 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Курсовое проектирование'},
        ],
        'вторая': [
           {'subject': 'Международные перевозки опасных грузов', 'time': '13:55-15:30', 'room': 'Ауд. 1103 К.8', 'teacher': 'Ходоскин Д.П.', 'type': 'Лекция'},
            {'subject': 'Международные перевозки опасных грузов', 'time': '15:40-17:15', 'room': 'Ауд. 1103 К.8', 'teacher': 'Ходоскин Д.П.', 'type': 'Практика'},
        ]
    },
    'чт': {
        'первая': [
            {'subject': 'Международные автоперевозки грузов и ТЭД', 'time': '13:55-15:30', 'room': 'Ауд. 1106 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Лабораторное занятие'},
            {'subject': 'Международные автоперевозки грузов и ТЭД', 'time': '15:40-17:15', 'room': 'Ауд. 1106 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Лекция'},
            {'subject': 'Охрана труда', 'time': '17:45-19:20', 'room': 'Ауд. 453 К.1', 'teacher': 'Абметко О.В.', 'type': 'Лекция'},
            
            

        ],
        'вторая': [
            {'subject': 'Международные автоперевозки грузов и ТЭД', 'time': '15:40-17:15', 'room': 'Ауд. 1106 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Лекция'},
            {'subject': 'Охрана труда', 'time': '17:45-19:20', 'room': 'Ауд. 453 К.1', 'teacher': 'Абметко О.В.', 'type': 'Лекция'},
            ]
    },
    'пт': {
        'первая': [
            {'subject': 'Международные автоперевозки грузов и ТЭД', 'time': '13:55-15:30', 'room': 'Ауд. 1103 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Лекция'},
            {'subject': 'Бухгалтеский учет. Биржевое и банковское дело', 'time': '15:40-17:15', 'room': 'Ауд. 608 К.8', 'teacher': 'Мойсак О.И.', 'type': 'Лекция'},
            {'subject': 'Бухгалтеский учет. Биржевое и банковское дело', 'time': '17:45-19:20', 'room': 'Ауд. 321 К.8', 'teacher': 'Мойсак О.И.', 'type': 'Практика'},

        ],
        'вторая': [
            {'subject': 'Международные автоперевозки грузов и ТЭД', 'time': '13:55-15:30', 'room': 'Ауд. 1103 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Лекция'},
            {'subject': 'Бухгалтеский учет. Биржевое и банковское дело', 'time': '15:40-17:15', 'room': 'Ауд. 608 К.8', 'teacher': 'Мойсак О.И.', 'type': 'Лекция'},
            {'subject': 'Международные автоперевозки грузов и ТЭД', 'time': '17:45-19:20', 'room': 'Ауд. 1103 К.8', 'teacher': 'Кустенко А.А.', 'type': 'Практика'},
        ]
    },
    'сб': {
        'первая': [
            {'subject': 'Транспортные тарифы', 'time': '9:55-11:30', 'room': 'Ауд. 804 К.8', 'teacher': 'Семченков С.С.', 'type': 'Лекция'},
            {'subject': 'Транспортные тарифы', 'time': '12:00-13:35', 'room': 'Ауд. 804 К.8', 'teacher': 'Семченков С.С.', 'type': 'Практика'},

        ],
        'вторая': [
            {'subject': 'Транспортные тарифы', 'time': '9:55-11:30', 'room': 'Ауд. 804 К.8', 'teacher': 'Семченков С.С.', 'type': 'Лекция'},
            {'subject': 'Английский Язык', 'time': '12:00-13:35', 'room': 'Ауд. 503 К.18', 'teacher': 'Ладутько Н.Ф.', 'type': 'Практика'},
            
]
    },
}
